app/controllers/rooms_controller.rb

  def create
    @room = Room.new permitted_parameters

    if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tes"], ["created_at", "2024-04-26 15:23:56.446445"], ["updated_at", "2024-04-26 15:23:56.446445"]]

  def show
    @room_message = RoomMessage.new room: @room
    @room_messages = @room.room_messages.all
---
SELECT "rooms".* FROM "rooms"
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = ?  [["room_id", 5]]

  def load_entities
    @rooms = Room.all
    @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]