app/controllers/room_messages_controller.rb

  def create
    @room_message = RoomMessage.create room: @room,message: params.dig(:room_message, :message)
---
INSERT INTO "room_messages" ("room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_id", 2], ["message", "aasd"], ["created_at", "2024-04-26 16:20:28.989066"], ["updated_at", "2024-04-26 16:20:28.989066"]]

  def load_entities
    @room = Room.find params.dig(:room_message, :room_id)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]